package stuctures.collection.map.interesting.task11;

public class Task11 {
    public static void main(String[] args) {
        // TODO
        //  Все копии добавить в Map<?,?>, содержащий в качестве ключа сам элемент а в качестве значения количество этих элементов в списке
        //  Развернуть Map (поменять местами ключ и значение)
        //  У полученной map поменять местами значения у двух разных ключей
        //  После этого удалить из неё все записи, в значениях которых будет меньше 3 элементов
    }
}
